Работа_с_формами_в_управляемом_интерфейсе/src/InformationRegisters/СтрокаВыбора/СтрокаВыбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтрокаВыбора</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Работа_с_формами_в_управляемом_интерфейсе/src/InformationRegisters/СтрокаВыбора/ManagerModule.bsl
Процедура Изменить(Номенклатура, Клиент, Количество) Экспорт

	Движение = СоздатьМенеджерЗаписи();

	Движение.Номенклатура = Номенклатура;
	Движение.Клиент = Клиент;

	Если (Количество = 0) Тогда
		Движение.Удалить();
	Иначе
		Движение.Количество = Количество;
		Движение.Записать();

	КонецЕсли;

КонецПроцедуры
